sub_df_eqp2 = 

      HST_REG_DTTM        WAF_ID  ZDDFRONTMEAN_01_AFS2  MEAN_ZDDFRONTMEAN_01_AFS2
15332   2024-09-30  A15QAG76SLD6            -10.291836                 -11.285315
15333   2024-09-30  A15QAG77SLA5            -14.822325                 -11.285315
15334   2024-09-30  A15QAG78SLE7            -13.132669                 -11.285315
15335   2024-09-30  A15QAG79SLB6            -12.702065                 -11.285315
15336   2024-09-30  A15W9C60SLH0            -11.206344                 -11.285315
...            ...           ...                   ...                        ...
17352   2024-10-16    B20064HUSL            -22.972179                 -31.727432
17347   2024-10-16    B20063LCSL            -35.285668                 -31.727432
17346   2024-10-16    B20063LBSL            -32.524327                 -31.727432
17348   2024-10-16    B20063LDSL            -35.448495                 -31.727432
17353   2024-10-16    B20064HVSL            -22.027977                 -31.727432


HST_REG_DTTM로 그룹화하고 waf_ID 갯수를 x 축
ZDDFRONTMEAN_01_AFS2값을 y축으로 점 형식으로 그래프를 그려줘.

HST_REG_DTTM가 다르면 색깔 다르게 설정

streamlit으로 구현해줘.
